hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/ble_services/ble_ancs_c/nrf_ble_ancs_c.c
                case ANCS_UUID_CHAR_DATA_SOURCE:
                    NRF_LOG_INFO("Data Source Characteristic found.");
                    memcpy(&evt.service.data_source_char,
                           &p_chars[i].characteristic,
                           sizeof(ble_gattc_char_t));
                    evt.service.data_source_cccd.handle = p_chars[i].cccd_handle;
                    break;
                    
                case ANCS_UUID_CHAR_NOTIFICATION_SOURCE:
                    NRF_LOG_INFO("Notification point Characteristic found.");
                    memcpy(&evt.service.notif_source_char,
                           &p_chars[i].characteristic,
                           sizeof(ble_gattc_char_t));
                    evt.service.notif_source_cccd.handle = p_chars[i].cccd_handle;
                    break;
                    
                default:
                    break;
            }
        }
        
        evt.evt_type    = BLE_ANCS_C_EVT_DISCOVERY_COMPLETE;
        evt.conn_handle = p_evt->conn_handle;
        p_ancs->evt_handler(&evt);
    }
    
    else
    {
        evt.evt_type = BLE_ANCS_C_EVT_DISCOVERY_FAILED;
        p_ancs->evt_handler(&evt);
    }
}


/** @brief Function for checking if data in an iOS notification is out of bounds.

    @param[in] notif  An iOS notification.

    @retval NRF_SUCCESS             If the notification is within bounds.
    @retval NRF_ERROR_INVALID_PARAM If the notification is out of bounds.
*/
static uint32_t ble_ancs_verify_notification_format(ble_ancs_c_evt_notif_t const *notif)
{
    if((notif->evt_id >= BLE_ANCS_NB_OF_EVT_ID)
       || (notif->category_id >= BLE_ANCS_NB_OF_CATEGORY_ID))
        return NRF_ERROR_INVALID_PARAM;
        
    return NRF_SUCCESS;
}

/** @brief Function for receiving and validating notifications received from the Notification Provider.

    @param[in] p_ancs     Pointer to an ANCS instance to which the event belongs.
    @param[in] p_data_src Pointer to data that was received from the Notification Provider.
    @param[in] hvx_len    Length of the data that was received by the Notification Provider.
*/
static void parse_notif(ble_ancs_c_t const *p_ancs,
                        uint8_t      const *p_data_src,
                        uint16_t     const   hvx_data_len)
{
    ble_ancs_c_evt_t ancs_evt;
    uint32_t         err_code;
    
    if(hvx_data_len != BLE_ANCS_NOTIFICATION_DATA_LENGTH)
    {
        ancs_evt.evt_type = BLE_ANCS_C_EVT_INVALID_NOTIF;
        p_ancs->evt_handler(&ancs_evt);
    }
    
    /*lint --e{415} --e{416} -save suppress Warning 415: possible access out of bond */
    ancs_evt.notif.evt_id                    =
        (ble_ancs_c_evt_id_values_t) p_data_src[BLE_ANCS_NOTIF_EVT_ID_INDEX];
        
    ancs_evt.notif.evt_flags.silent          =
        (p_data_src[BLE_ANCS_NOTIF_FLAGS_INDEX] >> BLE_ANCS_EVENT_FLAG_SILENT) & 0x01;
        
    ancs_evt.notif.evt_flags.important       =
        (p_data_src[BLE_ANCS_NOTIF_FLAGS_INDEX] >> BLE_ANCS_EVENT_FLAG_IMPORTANT) & 0x01;
        
    ancs_evt.notif.evt_flags.pre_existing    =
        (p_data_src[BLE_ANCS_NOTIF_FLAGS_INDEX] >> BLE_ANCS_EVENT_FLAG_PREEXISTING) & 0x01;
        
    ancs_evt.notif.evt_flags.positive_action =
        (p_data_src[BLE_ANCS_NOTIF_FLAGS_INDEX] >> BLE_ANCS_EVENT_FLAG_POSITIVE_ACTION) & 0x01;
        
    ancs_evt.notif.evt_flags.negative_action =
        (p_data_src[BLE_ANCS_NOTIF_FLAGS_INDEX] >> BLE_ANCS_EVENT_FLAG_NEGATIVE_ACTION) & 0x01;
        
    ancs_evt.notif.category_id               =
        (ble_ancs_c_category_id_val_t) p_data_src[BLE_ANCS_NOTIF_CATEGORY_ID_INDEX];
        
    ancs_evt.notif.category_count            = p_data_src[BLE_ANCS_NOTIF_CATEGORY_CNT_INDEX];
    ancs_evt.notif.notif_uid = uint32_decode(&p_data_src[BLE_ANCS_NOTIF_NOTIF_UID]);
    /*lint -restore*/
    
    err_code = ble_ancs_verify_notification_format(&ancs_evt.notif);
    
    if(err_code == NRF_SUCCESS)
        ancs_evt.evt_type = BLE_ANCS_C_EVT_NOTIF;
        
    else
        ancs_evt.evt_type = BLE_ANCS_C_EVT_INVALID_NOTIF;
        
    p_ancs->evt_handler(&ancs_evt);
}


ret_code_t nrf_ble_ancs_c_app_attr_request(ble_ancs_c_t   *p_ancs,
                                           uint8_t const *p_app_id,
                                           uint32_t        len)
{
    return ancs_c_app_attr_request(p_ancs, p_app_id, len);
}


/** @brief Function for receiving and validating notifications received from the Notification Provider.

    @param[in] p_ancs    Pointer to an ANCS instance to which the event belongs.
    @param[in] p_ble_evt Bluetooth stack event.
*/
static void on_evt_gattc_notif(ble_ancs_c_t *p_ancs, ble_evt_t const *p_ble_evt)
{
    ble_gattc_evt_hvx_t const *p_notif = &p_ble_evt->evt.gattc_evt.params.hvx;
    
    if(p_ble_evt->evt.gattc_evt.conn_handle != p_ancs->conn_handle)
        return;
        
    if(p_notif->handle == p_ancs->service.notif_source_char.handle_value)
        parse_notif(p_ancs, p_notif->data, p_notif->len);
        
    else if(p_notif->handle == p_ancs->service.data_source_char.handle_value)
        ancs_parse_get_attrs_response(p_ancs, p_notif->data, p_notif->len);
        
    else
    {
        // No applicable action.
    }
}

/** @brief Function for handling error response events.

    @param[in] p_ancs    Pointer to an ANCS instance to which the event belongs.
    @param[in] p_ble_evt Pointer to the SoftDevice event.
*/
static void on_ctrlpt_error_rsp(ble_ancs_c_t *p_ancs, ble_evt_t const *p_ble_evt)
{
    ble_ancs_c_evt_t ancs_evt;
    
    ancs_evt.evt_type    = BLE_ANCS_C_EVT_NP_ERROR;
    ancs_evt.err_code_np = p_ble_evt->evt.gattc_evt.gatt_status;
    
    p_ancs->evt_handler(&ancs_evt);
}

/** @brief Function for handling write response events.

    @param[in] p_ancs    Pointer to an ANCS instance to which the event belongs.
    @param[in] p_ble_evt Pointer to the SoftDevice event.
*/
static void on_write_rsp(ble_ancs_c_t *p_ancs, ble_evt_t const *p_ble_evt)
{
    // Check if the event if on the link for this instance
    if(p_ancs->conn_handle != p_ble_evt->evt.gattc_evt.conn_handle)
        return;
        
    if((p_ble_evt->evt.gattc_evt.error_handle != BLE_GATT_HANDLE_INVALID)
       && (p_ble_evt->evt.gattc_evt.error_handle == p_ancs->service.control_point_char.handle_value))
        on_ctrlpt_error_rsp(p_ancs, p_ble_evt);
        
